---
kind: other
id: Methods.T:Autodesk.Revit.DB.ISaveSharedCoordinatesCallback
source: html/8063194a-50a6-9070-e95d-ee4b9474b84e.htm
---
# ISaveSharedCoordinatesCallback Methods

Determines whether Revit should save the link, not save the link,
 or discard shared positioning entirely.